Revit 2027 API
ElectricalSystem.TrueLoad Property
 The TrueLoad value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TrueLoad { get; set; }
Public Property TrueLoad As Double
	Get
	Set
public:
property double TrueLoad {
	double get ();
	void set (double value);
}
member TrueLoad : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the TrueLoad value of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace